<?php
for ($i = 0; $i < 10; $i++) {
    // ↑forループ: 指定回数の繰り返し。0から9まで、10回ループする
    echo $i . "回目のこんにちは！<br>";
}
// $i++ は、$i = $i + 1 と同じ意味(インクリメント)

// 10から１まで、カウントダウンする
for ($i = 10; $i >= 1; $i--) { //$i-- デクリメント$iの値を１減らす
    echo $i . "...<br>";
}
echo "スタート！";
// 出力：10...9...8...7...6...5...4...3...2...1... スタート！

//foreachループ: 配列のための繰り返し
$fruits = ["りんご", "バナナ", "みかん"];

// 配列 $fruits の各要素を、順番に、変数　＄fruit に代入して、処理を繰り返す
foreach ($fruits as $fruit) {
    echo $fruit . "はおいしい！<br>";
}

$scores = [
    "国語" => 80,
    "数学" => 95,
    "英語" => 72,
];

// キーを $subject に、値を $score に代入してループ
foreach ($scores as $subject => $score) {
    echo $subject . "の点は、" . $score . "点です。<br>";
}